Dataframe basic operations

In [1]:
import numpy as np
import pandas as pd

In [3]:
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [7, 8, 9], 'B': [10, 11, 12]})

In [4]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [5]:
df2

   A   B
0  7  10
1  8  11
2  9  12

In [6]:
#shape
df1.shape

(3, 2)

In [7]:
#columns
df1.columns

Index(['A', 'B'], dtype='object')

In [8]:
#info   
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
dtypes: int64(2)
memory usage: 180.0 bytes

In [9]:
#describe
df1.describe()

         A    B
count  3.0  3.0
mean   2.0  5.0
std    1.0  1.0
min    1.0  4.0
25%    1.5  4.5
50%    2.0  5.0
75%    2.5  5.5
max    3.0  6.0

In [11]:
#operations sum,subtraction, multiplication, division
df1['B'] + 10
df1['B'] - 2
df1['B'] * 3
df1['B'] / 2

0    2.0
1    2.5
2    3.0
Name: B, dtype: float64

Dataframe applying Function

In [ ]:
#apply function
def square(x):
    return x**2

df1['B'].apply(square)

0    16
1    25
2    36
Name: B, dtype: int64

In [ ]:
df1 #nothing changed

   A  B
0  1  4
1  2  5
2  3  6

In [16]:
df1['C'] = df1['B'].apply(square)
df1

   A  B   c   C
0  1  4  16  16
1  2  5  25  25
2  3  6  36  36